{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "57d5f255-f834-4e92-b66c-3da9abf78640",
   "metadata": {},
   "outputs": [],
   "source": [
    "# %pip install langchain\n",
    "# %pip install langchain-experimental\n",
    "# %pip install langchain-openai\n",
    "# %pip install falkordb"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "4c1b6ab2-1679-4629-b677-4a6983e6fcc1",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "os.environ['OPENAI_API_KEY']=\"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\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "0f053d59-4347-41a5-81c7-553272a2070f",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_experimental.graph_transformers.diffbot import DiffbotGraphTransformer\n",
    "diffbot_api_key = \"a048854dd6c18c04c376beffea4165d5\"\n",
    "diffbot_nlp = DiffbotGraphTransformer(diffbot_api_key=diffbot_api_key)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "c7d0e6aa-577e-42d3-9b80-7d029357ed1d",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.document_loaders import WikipediaLoader, TextLoader\n",
    "from langchain_text_splitters import CharacterTextSplitter\n",
    "from langchain_community.document_loaders import WikipediaLoader, DiffbotLoader\n",
    "query = \"Warren Buffett\"\n",
    "raw_documents = WikipediaLoader(query=query).load()\n",
    "# urls=['https://python.langchain.com/en/latest/index.html']\n",
    "# graph_documents = DiffbotLoader(urls=urls, api_token=diffbot_api_key)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ea4220b2-5da7-4347-874f-e66eec3e9fa0",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_documents = diffbot_nlp.convert_to_graph_documents(raw_documents)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "4f50a37e-15c5-41f5-b290-f21d004359f6",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pickle\n",
    "with open('graph.pkl', 'wb') as f:\n",
    "    pickle.dump(graph_documents, f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "8e39d99b-4d92-478c-b69c-bd5e2df0ede2",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pickle\n",
    "with open('graph.pkl', 'rb') as f:\n",
    "    grp_documents = pickle.load(f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "4d7940d9-2e4a-4e43-897b-7e8f2e3971da",
   "metadata": {},
   "outputs": [],
   "source": [
    "# grp_documents"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "adc42073-327b-415a-ba7d-c80ef7b5e709",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.graphs import FalkorDBGraph\n",
    "graph = FalkorDBGraph(\"falkordb\")\n",
    "graph.add_graph_documents(graph_documents)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "12d080bd-64df-4c82-a876-6963088f549a",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.refresh_schema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "b4af374c-4a3f-42f3-89f7-bcb524c0744b",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = FalkorDBGraph(database=\"movies\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "bbea6383-bdd1-41ab-9449-03e923210142",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\n",
    "    \"\"\"\n",
    "    CREATE \n",
    "        (al:Person {name: 'Al Pacino', birthDate: '1940-04-25'}),\n",
    "        (robert:Person {name: 'Robert De Niro', birthDate: '1943-08-17'}),\n",
    "        (tom:Person {name: 'Tom Cruise', birthDate: '1962-07-3'}),\n",
    "        (val:Person {name: 'Val Kilmer', birthDate: '1959-12-31'}),\n",
    "        (anthony:Person {name: 'Anthony Edwards', birthDate: '1962-7-19'}),\n",
    "        (meg:Person {name: 'Meg Ryan', birthDate: '1961-11-19'}),\n",
    "\n",
    "        (god1:Movie {title: 'The Godfather'}),\n",
    "        (god2:Movie {title: 'The Godfather: Part II'}),\n",
    "        (god3:Movie {title: 'The Godfather Coda: The Death of Michael Corleone'}),\n",
    "        (top:Movie {title: 'Top Gun'}),\n",
    "\n",
    "        (al)-[:ACTED_IN]->(god1),\n",
    "        (al)-[:ACTED_IN]->(god2),\n",
    "        (al)-[:ACTED_IN]->(god3),\n",
    "        (robert)-[:ACTED_IN]->(god2),\n",
    "        (tom)-[:ACTED_IN]->(top),\n",
    "        (val)-[:ACTED_IN]->(top),\n",
    "        (anthony)-[:ACTED_IN]->(top),\n",
    "        (meg)-[:ACTED_IN]->(top)\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e530e787-c542-4e53-9518-fdbd20613fe7",
   "metadata": {},
   "source": [
    "#### docker run -p 6379:6379 -p 3000:3000 -it --rm falkordb/falkordb:latest\r\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "9cfaed28-11e3-4f31-af4f-512d537c6ef4",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_openai import OpenAI\n",
    "from langchain.chains import FalkorDBQAChain\n",
    "chain = FalkorDBQAChain.from_llm(OpenAI(temperature=0), graph=graph, verbose=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "618ea36b-ddcd-450b-ba22-29a342bf4e13",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new FalkorDBQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "\n",
      "MATCH (p:Person)-[:STUDIED_AT]->(s:School)\n",
      "WHERE p.name = 'Warren Buffett'\n",
      "RETURN s.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\" I don't know the answer.\""
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(f\"where did {query} study?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "2fd2f751-67ad-4c45-95de-986538d4d57b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new FalkorDBQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "\n",
      "MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title: \"The Godfather: Part II\"})\n",
      "RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[['Al Pacino'], ['Robert De Niro']]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "' Al Pacino, Robert De Niro'"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(\"Who acted in the godfather: part 2?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "e7b42acd-5941-4d69-b8fb-02ad61b904ff",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new FalkorDBQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "\n",
      "MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title: 'Top Gun'})\n",
      "RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[['Tom Cruise'], ['Val Kilmer'], ['Anthony Edwards'], ['Meg Ryan']]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "' Tom Cruise, Val Kilmer, Anthony Edwards, Meg Ryan acted in Top Gun'"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(\"who acted in top gun\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b6f394a3-5cf5-4329-a65c-f22a0035efe9",
   "metadata": {},
   "source": [
    "# Dagworks\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d8234a60-11f7-4e88-89f8-a6c27a08fe52",
   "metadata": {},
   "outputs": [],
   "source": [
    "from hamilton import driver\n",
    "import my_dag"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "2bfe07a1-ccd3-43de-a773-4c8543373460",
   "metadata": {},
   "outputs": [],
   "source": [
    "dr = driver.Builder().with_modules(my_dag).build()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "5e78fd71-f076-4289-9071-c196b45337a8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/svg+xml": [
       "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\n",
       "<!DOCTYPE svg PUBLIC \"-//W3C//DTD SVG 1.1//EN\"\n",
       " \"http://www.w3.org/Graphics/SVG/1.1/DTD/svg11.dtd\">\n",
       "<!-- Generated by graphviz version 2.50.0 (0)\n",
       " -->\n",
       "<!-- Pages: 1 -->\n",
       "<svg width=\"617pt\" height=\"249pt\"\n",
       " viewBox=\"0.00 0.00 617.00 249.00\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">\n",
       "<g id=\"graph0\" class=\"graph\" transform=\"scale(1 1) rotate(0) translate(4 245)\">\n",
       "<polygon fill=\"white\" stroke=\"transparent\" points=\"-4,4 -4,-245 613,-245 613,4 -4,4\"/>\n",
       "<g id=\"clust1\" class=\"cluster\">\n",
       "<title>cluster__legend</title>\n",
       "<polygon fill=\"#ffffff\" stroke=\"black\" points=\"11,-156 11,-233 97,-233 97,-156 11,-156\"/>\n",
       "<text text-anchor=\"middle\" x=\"54\" y=\"-217.8\" font-family=\"Helvetica,sans-Serif\" font-size=\"14.00\">Legend</text>\n",
       "</g>\n",
       "<!-- get_input_query -->\n",
       "<g id=\"node1\" class=\"node\">\n",
       "<title>get_input_query</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M368,-176C368,-176 264,-176 264,-176 258,-176 252,-170 252,-164 252,-164 252,-124 252,-124 252,-118 258,-112 264,-112 264,-112 368,-112 368,-112 374,-112 380,-118 380,-124 380,-124 380,-164 380,-164 380,-170 374,-176 368,-176\"/>\n",
       "<text text-anchor=\"start\" x=\"263\" y=\"-154.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">get_input_query</text>\n",
       "<text text-anchor=\"start\" x=\"308\" y=\"-126.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">str</text>\n",
       "</g>\n",
       "<!-- get_response_from_openai -->\n",
       "<g id=\"node4\" class=\"node\">\n",
       "<title>get_response_from_openai</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M597,-135C597,-135 421,-135 421,-135 415,-135 409,-129 409,-123 409,-123 409,-83 409,-83 409,-77 415,-71 421,-71 421,-71 597,-71 597,-71 603,-71 609,-77 609,-83 609,-83 609,-123 609,-123 609,-129 603,-135 597,-135\"/>\n",
       "<text text-anchor=\"start\" x=\"420\" y=\"-113.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">get_response_from_openai</text>\n",
       "<text text-anchor=\"start\" x=\"501\" y=\"-85.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">str</text>\n",
       "</g>\n",
       "<!-- get_input_query&#45;&gt;get_response_from_openai -->\n",
       "<g id=\"edge4\" class=\"edge\">\n",
       "<title>get_input_query&#45;&gt;get_response_from_openai</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M380.07,-130.46C386.13,-129.16 392.39,-127.82 398.73,-126.46\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"399.71,-129.83 408.75,-124.31 398.24,-122.98 399.71,-129.83\"/>\n",
       "</g>\n",
       "<!-- load_data -->\n",
       "<g id=\"node2\" class=\"node\">\n",
       "<title>load_data</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M211,-124C211,-124 149,-124 149,-124 143,-124 137,-118 137,-112 137,-112 137,-72 137,-72 137,-66 143,-60 149,-60 149,-60 211,-60 211,-60 217,-60 223,-66 223,-72 223,-72 223,-112 223,-112 223,-118 217,-124 211,-124\"/>\n",
       "<text text-anchor=\"start\" x=\"148\" y=\"-102.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">load_data</text>\n",
       "<text text-anchor=\"start\" x=\"171.5\" y=\"-74.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">list</text>\n",
       "</g>\n",
       "<!-- setup_falkordb -->\n",
       "<g id=\"node5\" class=\"node\">\n",
       "<title>setup_falkordb</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M363.5,-94C363.5,-94 268.5,-94 268.5,-94 262.5,-94 256.5,-88 256.5,-82 256.5,-82 256.5,-42 256.5,-42 256.5,-36 262.5,-30 268.5,-30 268.5,-30 363.5,-30 363.5,-30 369.5,-30 375.5,-36 375.5,-42 375.5,-42 375.5,-82 375.5,-82 375.5,-88 369.5,-94 363.5,-94\"/>\n",
       "<text text-anchor=\"start\" x=\"267.5\" y=\"-72.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">setup_falkordb</text>\n",
       "<text text-anchor=\"start\" x=\"293\" y=\"-44.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">module</text>\n",
       "</g>\n",
       "<!-- load_data&#45;&gt;setup_falkordb -->\n",
       "<g id=\"edge5\" class=\"edge\">\n",
       "<title>load_data&#45;&gt;setup_falkordb</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M223.03,-82.59C230.56,-80.9 238.58,-79.11 246.63,-77.31\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"247.43,-80.71 256.43,-75.11 245.91,-73.88 247.43,-80.71\"/>\n",
       "</g>\n",
       "<!-- diffbot_setup -->\n",
       "<g id=\"node3\" class=\"node\">\n",
       "<title>diffbot_setup</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M96,-146C96,-146 12,-146 12,-146 6,-146 0,-140 0,-134 0,-134 0,-94 0,-94 0,-88 6,-82 12,-82 12,-82 96,-82 96,-82 102,-82 108,-88 108,-94 108,-94 108,-134 108,-134 108,-140 102,-146 96,-146\"/>\n",
       "<text text-anchor=\"start\" x=\"11\" y=\"-124.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">diffbot_setup</text>\n",
       "<text text-anchor=\"start\" x=\"31\" y=\"-96.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">module</text>\n",
       "</g>\n",
       "<!-- diffbot_setup&#45;&gt;load_data -->\n",
       "<g id=\"edge1\" class=\"edge\">\n",
       "<title>diffbot_setup&#45;&gt;load_data</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M108.31,-104.54C114.45,-103.45 120.7,-102.34 126.83,-101.26\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"127.73,-104.65 136.97,-99.46 126.51,-97.76 127.73,-104.65\"/>\n",
       "</g>\n",
       "<!-- setup_falkordb&#45;&gt;get_response_from_openai -->\n",
       "<g id=\"edge3\" class=\"edge\">\n",
       "<title>setup_falkordb&#45;&gt;get_response_from_openai</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M375.6,-74.58C383.01,-76.17 390.76,-77.83 398.64,-79.52\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"398.16,-83 408.67,-81.68 399.63,-76.16 398.16,-83\"/>\n",
       "</g>\n",
       "<!-- config -->\n",
       "<g id=\"node6\" class=\"node\">\n",
       "<title>config</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M73.5,-64C73.5,-64 34.5,-64 34.5,-64 28.5,-64 22.5,-58 22.5,-52 22.5,-52 22.5,-12 22.5,-12 22.5,-6 28.5,0 34.5,0 34.5,0 73.5,0 73.5,0 79.5,0 85.5,-6 85.5,-12 85.5,-12 85.5,-52 85.5,-52 85.5,-58 79.5,-64 73.5,-64\"/>\n",
       "<text text-anchor=\"start\" x=\"33.5\" y=\"-42.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">config</text>\n",
       "<text text-anchor=\"start\" x=\"43\" y=\"-14.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">dict</text>\n",
       "</g>\n",
       "<!-- config&#45;&gt;load_data -->\n",
       "<g id=\"edge2\" class=\"edge\">\n",
       "<title>config&#45;&gt;load_data</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M85.65,-46.83C98.24,-52.92 113.17,-60.15 127.36,-67.01\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"126.01,-70.25 136.54,-71.46 129.06,-63.95 126.01,-70.25\"/>\n",
       "</g>\n",
       "<!-- config&#45;&gt;setup_falkordb -->\n",
       "<g id=\"edge6\" class=\"edge\">\n",
       "<title>config&#45;&gt;setup_falkordb</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M85.66,-35.41C119.35,-39.17 175.04,-45.42 223,-51 230.44,-51.87 238.22,-52.78 245.97,-53.7\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"245.77,-57.2 256.11,-54.9 246.59,-50.25 245.77,-57.2\"/>\n",
       "</g>\n",
       "<!-- function -->\n",
       "<g id=\"node7\" class=\"node\">\n",
       "<title>function</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M77,-201.5C77,-201.5 31,-201.5 31,-201.5 25,-201.5 19,-195.5 19,-189.5 19,-189.5 19,-176.5 19,-176.5 19,-170.5 25,-164.5 31,-164.5 31,-164.5 77,-164.5 77,-164.5 83,-164.5 89,-170.5 89,-176.5 89,-176.5 89,-189.5 89,-189.5 89,-195.5 83,-201.5 77,-201.5\"/>\n",
       "<text text-anchor=\"middle\" x=\"54\" y=\"-179.3\" font-family=\"Helvetica,sans-Serif\" font-size=\"14.00\">function</text>\n",
       "</g>\n",
       "</g>\n",
       "</svg>\n"
      ],
      "text/plain": [
       "<graphviz.graphs.Digraph at 0x14b069a8ee0>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# dr.display_all_functions(\"dag.png\")  # outputs a file dag.png\n",
    "dr.display_all_functions()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "86580fc7-8bd2-4002-9b27-544994501071",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "display_graph=True is deprecated. It will be removed in the 2.0.0 release. Please use visualize_execution().\n",
      "display_graph=True is deprecated. It will be removed in the 2.0.0 release. Please use visualize_execution().\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Write your query here-> Who acted in The Godfather: Part II?\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\ASUS\\anaconda3\\envs\\new\\lib\\site-packages\\langchain_core\\_api\\deprecation.py:117: LangChainDeprecationWarning: The function `run` was deprecated in LangChain 0.1.0 and will be removed in 0.2.0. Use invoke instead.\n",
      "  warn_deprecated(\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new FalkorDBQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "\n",
      "MATCH (p:Person)-[:ACTED_IN]->(m:Movie)\n",
      "WHERE m.title = 'The Godfather: Part II'\n",
      "RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[['Al Pacino'], ['Robert De Niro'], ['Al Pacino'], ['Robert De Niro'], ['Al Pacino'], ['Robert De Niro']]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'get_response_from_openai': ' Al Pacino, Robert De Niro'}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dr.execute(final_vars=['get_response_from_openai'],display_graph=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "cf439d21-93d2-4c94-b6c9-3fd98fc3dc47",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/svg+xml": [
       "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\n",
       "<!DOCTYPE svg PUBLIC \"-//W3C//DTD SVG 1.1//EN\"\n",
       " \"http://www.w3.org/Graphics/SVG/1.1/DTD/svg11.dtd\">\n",
       "<!-- Generated by graphviz version 2.50.0 (0)\n",
       " -->\n",
       "<!-- Pages: 1 -->\n",
       "<svg width=\"617pt\" height=\"345pt\"\n",
       " viewBox=\"0.00 0.00 617.00 345.00\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">\n",
       "<g id=\"graph0\" class=\"graph\" transform=\"scale(1 1) rotate(0) translate(4 341)\">\n",
       "<polygon fill=\"white\" stroke=\"transparent\" points=\"-4,4 -4,-341 613,-341 613,4 -4,4\"/>\n",
       "<g id=\"clust1\" class=\"cluster\">\n",
       "<title>cluster__legend</title>\n",
       "<polygon fill=\"#ffffff\" stroke=\"black\" points=\"11,-197 11,-329 97,-329 97,-197 11,-197\"/>\n",
       "<text text-anchor=\"middle\" x=\"54\" y=\"-313.8\" font-family=\"Helvetica,sans-Serif\" font-size=\"14.00\">Legend</text>\n",
       "</g>\n",
       "<!-- diffbot_setup -->\n",
       "<g id=\"node1\" class=\"node\">\n",
       "<title>diffbot_setup</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M96,-187C96,-187 12,-187 12,-187 6,-187 0,-181 0,-175 0,-175 0,-135 0,-135 0,-129 6,-123 12,-123 12,-123 96,-123 96,-123 102,-123 108,-129 108,-135 108,-135 108,-175 108,-175 108,-181 102,-187 96,-187\"/>\n",
       "<text text-anchor=\"start\" x=\"11\" y=\"-165.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">diffbot_setup</text>\n",
       "<text text-anchor=\"start\" x=\"31\" y=\"-137.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">module</text>\n",
       "</g>\n",
       "<!-- load_data -->\n",
       "<g id=\"node5\" class=\"node\">\n",
       "<title>load_data</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M211,-187C211,-187 149,-187 149,-187 143,-187 137,-181 137,-175 137,-175 137,-135 137,-135 137,-129 143,-123 149,-123 149,-123 211,-123 211,-123 217,-123 223,-129 223,-135 223,-135 223,-175 223,-175 223,-181 217,-187 211,-187\"/>\n",
       "<text text-anchor=\"start\" x=\"148\" y=\"-165.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">load_data</text>\n",
       "<text text-anchor=\"start\" x=\"171.5\" y=\"-137.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">list</text>\n",
       "</g>\n",
       "<!-- diffbot_setup&#45;&gt;load_data -->\n",
       "<g id=\"edge3\" class=\"edge\">\n",
       "<title>diffbot_setup&#45;&gt;load_data</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M108.31,-155C114.45,-155 120.7,-155 126.83,-155\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"126.97,-158.5 136.97,-155 126.97,-151.5 126.97,-158.5\"/>\n",
       "</g>\n",
       "<!-- setup_falkordb -->\n",
       "<g id=\"node2\" class=\"node\">\n",
       "<title>setup_falkordb</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M363.5,-146C363.5,-146 268.5,-146 268.5,-146 262.5,-146 256.5,-140 256.5,-134 256.5,-134 256.5,-94 256.5,-94 256.5,-88 262.5,-82 268.5,-82 268.5,-82 363.5,-82 363.5,-82 369.5,-82 375.5,-88 375.5,-94 375.5,-94 375.5,-134 375.5,-134 375.5,-140 369.5,-146 363.5,-146\"/>\n",
       "<text text-anchor=\"start\" x=\"267.5\" y=\"-124.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">setup_falkordb</text>\n",
       "<text text-anchor=\"start\" x=\"293\" y=\"-96.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">module</text>\n",
       "</g>\n",
       "<!-- get_response_from_openai -->\n",
       "<g id=\"node6\" class=\"node\">\n",
       "<title>get_response_from_openai</title>\n",
       "<path fill=\"#ffc857\" stroke=\"black\" d=\"M597,-105C597,-105 421,-105 421,-105 415,-105 409,-99 409,-93 409,-93 409,-53 409,-53 409,-47 415,-41 421,-41 421,-41 597,-41 597,-41 603,-41 609,-47 609,-53 609,-53 609,-93 609,-93 609,-99 603,-105 597,-105\"/>\n",
       "<text text-anchor=\"start\" x=\"420\" y=\"-83.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">get_response_from_openai</text>\n",
       "<text text-anchor=\"start\" x=\"501\" y=\"-55.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">str</text>\n",
       "</g>\n",
       "<!-- setup_falkordb&#45;&gt;get_response_from_openai -->\n",
       "<g id=\"edge4\" class=\"edge\">\n",
       "<title>setup_falkordb&#45;&gt;get_response_from_openai</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M375.6,-101.42C383.01,-99.83 390.76,-98.17 398.64,-96.48\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"399.63,-99.84 408.67,-94.32 398.16,-93 399.63,-99.84\"/>\n",
       "</g>\n",
       "<!-- get_input_query -->\n",
       "<g id=\"node3\" class=\"node\">\n",
       "<title>get_input_query</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M368,-64C368,-64 264,-64 264,-64 258,-64 252,-58 252,-52 252,-52 252,-12 252,-12 252,-6 258,0 264,0 264,0 368,0 368,0 374,0 380,-6 380,-12 380,-12 380,-52 380,-52 380,-58 374,-64 368,-64\"/>\n",
       "<text text-anchor=\"start\" x=\"263\" y=\"-42.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">get_input_query</text>\n",
       "<text text-anchor=\"start\" x=\"308\" y=\"-14.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">str</text>\n",
       "</g>\n",
       "<!-- get_input_query&#45;&gt;get_response_from_openai -->\n",
       "<g id=\"edge5\" class=\"edge\">\n",
       "<title>get_input_query&#45;&gt;get_response_from_openai</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M380.07,-45.54C386.13,-46.84 392.39,-48.18 398.73,-49.54\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"398.24,-53.02 408.75,-51.69 399.71,-46.17 398.24,-53.02\"/>\n",
       "</g>\n",
       "<!-- config -->\n",
       "<g id=\"node4\" class=\"node\">\n",
       "<title>config</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M199.5,-105C199.5,-105 160.5,-105 160.5,-105 154.5,-105 148.5,-99 148.5,-93 148.5,-93 148.5,-53 148.5,-53 148.5,-47 154.5,-41 160.5,-41 160.5,-41 199.5,-41 199.5,-41 205.5,-41 211.5,-47 211.5,-53 211.5,-53 211.5,-93 211.5,-93 211.5,-99 205.5,-105 199.5,-105\"/>\n",
       "<text text-anchor=\"start\" x=\"159.5\" y=\"-83.8\" font-family=\"Helvetica,sans-Serif\" font-weight=\"bold\" font-size=\"14.00\">config</text>\n",
       "<text text-anchor=\"start\" x=\"169\" y=\"-55.8\" font-family=\"Helvetica,sans-Serif\" font-style=\"italic\" font-size=\"14.00\">dict</text>\n",
       "</g>\n",
       "<!-- config&#45;&gt;setup_falkordb -->\n",
       "<g id=\"edge2\" class=\"edge\">\n",
       "<title>config&#45;&gt;setup_falkordb</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M211.74,-82.41C222.23,-85.61 234.41,-89.34 246.65,-93.09\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"245.87,-96.51 256.45,-96.09 247.92,-89.81 245.87,-96.51\"/>\n",
       "</g>\n",
       "<!-- load_data&#45;&gt;setup_falkordb -->\n",
       "<g id=\"edge1\" class=\"edge\">\n",
       "<title>load_data&#45;&gt;setup_falkordb</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M223.03,-142.14C230.56,-139.84 238.58,-137.38 246.63,-134.92\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"247.89,-138.19 256.43,-131.92 245.84,-131.5 247.89,-138.19\"/>\n",
       "</g>\n",
       "<!-- function -->\n",
       "<g id=\"node7\" class=\"node\">\n",
       "<title>function</title>\n",
       "<path fill=\"#b4d8e4\" stroke=\"black\" d=\"M77,-297.5C77,-297.5 31,-297.5 31,-297.5 25,-297.5 19,-291.5 19,-285.5 19,-285.5 19,-272.5 19,-272.5 19,-266.5 25,-260.5 31,-260.5 31,-260.5 77,-260.5 77,-260.5 83,-260.5 89,-266.5 89,-272.5 89,-272.5 89,-285.5 89,-285.5 89,-291.5 83,-297.5 77,-297.5\"/>\n",
       "<text text-anchor=\"middle\" x=\"54\" y=\"-275.3\" font-family=\"Helvetica,sans-Serif\" font-size=\"14.00\">function</text>\n",
       "</g>\n",
       "<!-- output -->\n",
       "<g id=\"node8\" class=\"node\">\n",
       "<title>output</title>\n",
       "<path fill=\"#ffc857\" stroke=\"black\" d=\"M72,-242.5C72,-242.5 36,-242.5 36,-242.5 30,-242.5 24,-236.5 24,-230.5 24,-230.5 24,-217.5 24,-217.5 24,-211.5 30,-205.5 36,-205.5 36,-205.5 72,-205.5 72,-205.5 78,-205.5 84,-211.5 84,-217.5 84,-217.5 84,-230.5 84,-230.5 84,-236.5 78,-242.5 72,-242.5\"/>\n",
       "<text text-anchor=\"middle\" x=\"54\" y=\"-220.3\" font-family=\"Helvetica,sans-Serif\" font-size=\"14.00\">output</text>\n",
       "</g>\n",
       "</g>\n",
       "</svg>\n"
      ],
      "text/plain": [
       "<graphviz.graphs.Digraph at 0x1b475fcb1c0>"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dr.visualize_execution(final_vars=['get_response_from_openai'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1b2ca33a-f1d0-40a9-94c4-b5fb77293bac",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
